Repository: GASTDASH/merchok
Catalog: lib/l10n/intl_*.arb
Languages: ru

source: All
ru: Все

source: Search
ru: Найти

source: Description...
ru: Описание...

# merchDefaultName
source: Merch name
ru: Название мерча

source: Save
ru: Сохранить

source: Price
ru: Цена

source: Add
ru: Добавить

source: Import
ru: Импортировать

source: Purchase Price
ru: Закупочная цена

source: Where to import from?
ru: Откуда будем импортировать?

source: From Excel
ru: Из Excel

source: From CSV
ru: Из CSV

source: (not available yet)
ru: (пока недоступно)

source: (recommended)
ru: (рекомендуется)

source: Festivals
ru: Фестивали

source: Event Date
ru: Дата проведения

# emptyCart
source: Cart is empty
ru: Корзина пуста

source: Total:
ru: Итого:

source: Checkout
ru: Оформить

source: Receipt from
ru: Чек от

source: General sales statistics
ru: Общая статистика продаж

source: Popular merch
ru: Популярный мерч

source: History of festivals
ru: История фестивалей

source: Average receipt
ru: Средний чек

source: Customer preferences
ru: Предпочтения покупателей

source: Profit
ru: Выгода

source: Theme
ru: Тема

# themeDescription
source: Change app theme
ru: Изменение темы приложения

source: Language
ru: Язык

# languageDescription
source: Change regional settings
ru: Изменение региональных настроек

source: Data export
ru: Экспорт данных

# exportDataDescription
source: Export data to transfer to another device
ru: Экспортировать данные для переноса на другое устройство

source: Payment methods
ru: Способы оплаты

# paymentMethodsDescription
source: Set up payment methods for your customers
ru: Настроить способы оплаты для ваших покупателей

source: About
ru: О приложении

# aboutDescription
source: App information
ru: Информация о приложении

source: Enter name
ru: Введите имя

source: Cash
ru: Наличными

source: Transfer
ru: Переводом

source: Light
ru: Светлая

source: Dark
ru: Тёмная

source: What to export?
ru: Что экспортировать?

source: All at once
ru: Всё сразу

source: Merch
ru: Мерч

source: Order history
ru: История заказов

source: Payment method
ru: Способ оплаты

source: Order successfully created!
ru: Заказ успешно создан!

source: Go to Orders
ru: Перейти к заказам

source: Back
ru: Назад

source: Title
ru: Название

source: Information
ru: Информация

source: Additional information
ru: Доп. информация

# enterTitle
source: Enter the title
ru: Введите название

# enterInformation
source: Enter the information
ru: Введите информацию

source: Filter
ru: Фильтр

source: Order amount
ru: Сумма заказа

source: Order creation period
ru: Период создания заказа

# selectPeriod
source: Select a period
ru: Выбрать период

source: Apply
ru: Применить

source: Icon
ru: Иконка

source: Yes
ru: Да

source: No
ru: Нет

# noMerch
source: You don't have any merch yet
ru: У вас пока нет мерча

source: Something went wrong
ru: Что-то пошло не так

source: Unexpected state
ru: Неожиданное состояние

source: Merch list not loaded
ru: Список мерча не загружен

source: Delete this merch?
ru: Удалить этот мерч?

# enterCorrectNumber
source: Enter a correct number
ru: Введите правильное число

source: Untitled
ru: Без названия

# cartLoading
source: Loading the cart
ru: Загрузка корзины

source: Adding to cart
ru: Добавление в корзину

# festivalLoading
source: Loading the festival list
ru: Загрузка списка фестивалей

# festivalCreating
source: Creating a festival
ru: Создание фестиваля

# festivalChangeInfo
source: Changing festival information
ru: Изменение информации о фестивале

# festivalDeleting
source: Deleting a festival
ru: Удаление фестиваля

# noFestivals
source: You don't have any festivals yet
ru: У вас пока нет фестивалей

# merchLoading
source: Loading the merch list
ru: Получение списка мерчей

# merchCreating
source: Creating a new merch
ru: Создание нового мерча

# merchChangeInfo
source: Changing merch information
ru: Изменение информации о мерче

# merchDeleting
source: Deleting a merch
ru: Удаление мерча

# festivalNotSelected
source: The festival is not selected
ru: Фестиваль не выбран

source: Loading
ru: Загрузка

# festivalSelecting
source: Selecting a festival
ru: Выбор фестиваля

source: Add your first payment method
ru: Добавьте свой первый способ оплаты

source: Delete this payment method?
ru: Удалить этот способ оплаты?

# paymentMethodLoading
source: Loading the payment method list
ru: Загрузка способов оплаты

# paymentMethodCreating
source: Creating a payment method
ru: Создание способа оплаты

# paymentMethodChanging
source: Changing payment method information
ru: Изменение способа оплаты

# paymentMethodDeleting
source: Deleting a payment method
ru: Удаление способа оплаты

source: Delete this festival?
ru: Удалить этот фестиваль?

# merchIsNotLoaded
source: The merch list is not loaded
ru: Мерч не загружен

# selectPaymentMethod
source: Select a payment method
ru: Выберите способ оплаты

# noPaymentMethods
source: You don't have any payment methods yet
ru: У вас пока нет способов оплаты

source: Error loading payment methods
ru: Ошибка загрузки способов оплаты

# paymentMethodsNotLoaded
source: Payment methods are not loaded
ru: Способы оплаты не загружены

# noMatchingMerch
source: No matching merches was found
ru: Не найдено подходящего мерча

source: Temporary unavailable
ru: Временно недоступно

# noReceipts
source: You don't have any saved receipts
ru: У вас нет сохранённых чеков

# receiptsLoading
source: Loading receipts
ru: Загрузка чеков

# receiptSaving
source: Saving the receipt
ru: Сохранение чека

# receiptDeleting
source: Deleting the receipt
ru: Удаление чека

# unableToDeleteMerch
source: Unable to delete a merch, because it's in the cart
ru: Невозможно удалить мерч, так как он находится в корзине

# noMatchingOrders
source: No matching orders was found
ru: Не найдено подходящих заказов

source: Sorting
ru: Сортировка

source: Clear filter
ru: Очистить фильтр

# ordersIsNotLoaded
source: The order list is not loaded
ru: Заказы не загружены

source: Donate
ru: Пожертвование

# donateDescription
source: Send tips for project growth
ru: Отправить чаевые на развитие проекта

# couldntOpenPage
source: Couldn't open the page
ru: Не удалось открыть страницу

# openingPage
source: Opening a page
ru: Открытие страницы

# goToTheDonatePage
source: Go to the tip payment page?
ru: Перейти на страницу оплаты чаевых?

# categoryLoading
source: Loading the category list
ru: Загрузка категорий

# categoryCreating
source: Creating a category
ru: Создание категории

# categoryDeleting
source: Deleting a category
ru: Удаление категории

# noCategories
source: You don't have any categories yet
ru: У вас пока нет категорий

source: Loading error
ru: Ошибка загрузки

source: Delete this category?
ru: Удалить эту категорию?

# unableToDeleteCategory
source: Unable to delete a category that is being used
ru: Невозможно удалить используемую категорию

# fileSuccessfullySaved
source: The file was saved successfully
ru: Файл успешно сохранён

source: File path:
ru: Путь к файлу:

# merchImporting
source: Importing the merch list
ru: Импортирование списка мерча

# receiptImporting
source: Importing the receipt list
ru: Импортирование чеков

# paymentMethodImporting
source: Importing the payment method list
ru: Импортирование способов оплаты

# festivalImporting
source: Importing the festival list
ru: Импортирование фестивалей

source: Exit the app?
ru: Выйти из приложения?

# unexpectedFlutterError
source: An unexpected Flutter error has occurred
ru: Произошла непредвиденная ошибка Flutter

source: Revenue
ru: Выручка

source: Sales
ru: Продаж

source: Orders
ru: Заказов

source: Earned
ru: Заработано

source: Date of the event
ru: Дата проведения

source: Total orders
ru: Всего заказов

source: Total sales
ru: Всего продаж

source: Past festivals
ru: Прошедшие фестивали

source: Not enough data
ru: Не хватает данных

source: Display type:
ru: Тип отображения:

source: No data to display
ru: Нет данных для отображения
